from supabase import create_client, Client
from supabase_client import supabase

account_rules = {
    11301: "외상매출금",
    11401: "미수금",
    11501: "선급부가세",
    11601: "상품",
    21101: "외상매입금",
    21501: "예수부가세",
    41101: "상품매출",
    51101: "판매수수료",
    51201: "입출고비",
    51202: "입출고비_할인",
    51301: "배송비",
    51302: "배송비_할인",
    51303: "배송비_추가비용",
    51401: "반품회수비",
    51402: "반품회수비_할인",
    51403: "반품회수비_무료프로모션",
    51501: "반품재입고비",
    51502: "반품재입고_할인",
    51503: "반품재입고_무료프로모션",
    51601: "보관비",
    51602: "보관비_할인",
    51603: "보관비_프로모션",
    51701: "부가서비스비",
    51702: "부가서비스비_할인",
    51801: "반출비",
    51802: "반출비_할인",
    51803: "반출비_프로모션",
    71101: "잡이익_재고손실보상",
    75101: "재고자산감모손실"
}



records = [{"code": k, "name": v} for k, v in account_rules.items()]
response = supabase.table("Accounts").insert(records).execute()
print(response)
